-- Figure 6: DNS Analysis Using Known IOCs
-- Purpose: Identify all users querying malicious domains

index=final_project sourcetype=dns
| search query_domain="*glasslu.com*"
| stats count by user src_ip query_domain
